import { Accordion } from "@mantine/core";
import styles from "./index.module.scss";
import AppWrapper from "@/components/ui/wrapper/AppWrapper";
import { MessageCircleQuestionMark } from "lucide-react";

const faq = [
  {
    id: "1",
    question: "Что такое «Название сервиса»?1",
    answer:
      "«Название сервиса» — онлайн-платформа для сохранения и передачи памяти о близких людях, важных событиях и значимых местах будущим поколениям. Сервис объединяет интерактивные биографии, семейные древа, мемуары и истории памятных мест, позволяя пользователям связывать их между собой в едином цифровом пространстве.",
  },
  {
    id: "2",
    question: "Где хранятся данные?1",
    answer:
      "Мы используем инфраструктуру «Яндекс Облака». А также производим независимое сохранение копии базы данных в дополнительных хранилищах информации, чтобы ничего не потерялось, и было бережно сохранено.",
  },
  {
    id: "3",
    question: "Как работает сервис?1",
    answer:
      "Мы используем инфраструктуру «Яндекс Облака». А также производим независимое сохранение копии базы данных в дополнительных хранилищах информации, чтобы ничего не потерялось, и было бережно сохранено.",
  },
  {
    id: "4",
    question: "Что такое «Название сервиса»?2",
    answer:
      "«Название сервиса» — онлайн-платформа для сохранения и передачи памяти о близких людях, важных событиях и значимых местах будущим поколениям. Сервис объединяет интерактивные биографии, семейные древа, мемуары и истории памятных мест, позволяя пользователям связывать их между собой в едином цифровом пространстве.",
  },
  {
    id: "5",
    question: "Где хранятся данные?2",
    answer:
      "Мы используем инфраструктуру «Яндекс Облака». А также производим независимое сохранение копии базы данных в дополнительных хранилищах информации, чтобы ничего не потерялось, и было бережно сохранено.",
  },
  {
    id: "6",
    question: "Как работает сервис?2",
    answer:
      "Мы используем инфраструктуру «Яндекс Облака». А также производим независимое сохранение копии базы данных в дополнительных хранилищах информации, чтобы ничего не потерялось, и было бережно сохранено.",
  },
  {
    id: "7",
    question: "Как работает сервис?3",
    answer:
      "Мы используем инфраструктуру «Яндекс Облака». А также производим независимое сохранение копии базы данных в дополнительных хранилищах информации, чтобы ничего не потерялось, и было бережно сохранено.",
  },
  {
    id: "8",
    question: "Что такое «Название сервиса»?3",
    answer:
      "«Название сервиса» — онлайн-платформа для сохранения и передачи памяти о близких людях, важных событиях и значимых местах будущим поколениям. Сервис объединяет интерактивные биографии, семейные древа, мемуары и истории памятных мест, позволяя пользователям связывать их между собой в едином цифровом пространстве.",
  },
  {
    id: "9",
    question: "Где хранятся данные?3",
    answer:
      "Мы используем инфраструктуру «Яндекс Облака». А также производим независимое сохранение копии базы данных в дополнительных хранилищах информации, чтобы ничего не потерялось, и было бережно сохранено.",
  },
];

export const FaqComponent = () => {
  return (
    <AppWrapper>
      <Accordion variant="contained" defaultValue={null}>
        {faq.map((item) => (
          <Accordion.Item key={item.id} value={item.question}>
            <Accordion.Control
              icon={<MessageCircleQuestionMark color="gray" />}
            >
              {item.question}
            </Accordion.Control>
            <Accordion.Panel>{item.answer}</Accordion.Panel>
          </Accordion.Item>
        ))}
      </Accordion>
    </AppWrapper>
  );
};
